const { Events, Interaction, EmbedBuilder } = require("discord.js");
const { Database } = require("st.db");


module.exports = {
  name: Events.InteractionCreate,
  async execute(interaction) {
    if (interaction.isButton()) {
      if (interaction.customId == "showinfo") {
        // التحقق من وجود خيارات الأمر والخيار "user"

       

        // إنشاء EmbedBuilder
        const embedBuilder = new EmbedBuilder()
          .setColor("#f6f6f6")
          .setTitle(`معلومات مهمة حول بوتات 🌟 ${interaction.guild.name}.`)
     .setDescription(`

🤖 **جميع البوتات تعتمد على نموذج اشتراك شهري.** يمكن تغيير أسعار البوتات في أي وقت، وننصح المشترين بمتابعة التحديثات.

📜 **شروط الشراء والتشغيل:**
- عند شراء وتشغيل البوت، لا يمكن استرداد قيمته.
- يجب تجديد الاشتراك قبل انتهاء صلاحيته، وبعد انتهاء الاشتراك، يتعين شراء بوت جديد.

🚀 **بوت الكل في واحد:**
- يحتوي بوت الكل في واحد على معظم الخصائص المتاحة في البوتات الأخرى، ولكن ليس كلها.

🔒 **الخصوصية والأمان:**
- جميع بيانات البوتات محفوظة في سيرفرات Bleto  معلوماتك خاصة وآمنة ولن يتم مشاركتها وفقًا لسياسة الخصوصية الخاصة بالسيرفر.

🌐 **جودة الخدمة:**
- نلتزم بتقديم أعلى جودة ممكنة، ونقوم بتحسين سرعة استجابة البوت بانتظام لتوفير تجربة خدمة محسّنة لعملائنا.

⚠️ **شروط الإغلاق:**
- تحتفظ شركة Bleto  بالحق في إغلاق أي بوت بدون إنذار مسبق في حالة انتهاك أيًا من شروط الخدمة لدينا.

نحن هنا لتلبية احتياجاتك وضمان تجربة استخدام رائعة! 🚀
`);

        // إرسال الرد بشكل جذاب للمتفاعل فقط
        interaction.reply({ embeds: [embedBuilder], ephemeral: true });
      }
    }
  },
};
